## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 88 to add, 0 to change, 88 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;CFT-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Crime - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;HMCTS - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Heritage-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Platform-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-NonProd - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-Prod - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;SDS-Sandbox - Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;Security - Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleAssignments/94666ad3-d2c5-16d7-5e61-a0b7c1b27e7e" -> (known after apply)
      ~ name                             = "94666ad3-d2c5-16d7-5e61-a0b7c1b27e7e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleAssignments/cae418ae-0c99-f63b-94fc-b3f438e52455" -> (known after apply)
      ~ name                             = "cae418ae-0c99-f63b-94fc-b3f438e52455" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleAssignments/82f951e5-cc89-aa3e-7994-7fa74236054c" -> (known after apply)
      ~ name                             = "82f951e5-cc89-aa3e-7994-7fa74236054c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleAssignments/34118596-d1d6-9f8c-7403-d6285bdfac2e" -> (known after apply)
      ~ name                             = "34118596-d1d6-9f8c-7403-d6285bdfac2e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleAssignments/4f615442-34dc-3e41-8bae-c1124f1f7ccb" -> (known after apply)
      ~ name                             = "4f615442-34dc-3e41-8bae-c1124f1f7ccb" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleAssignments/f7f99e2a-b1f0-6035-cb33-2f8e135d6555" -> (known after apply)
      ~ name                             = "f7f99e2a-b1f0-6035-cb33-2f8e135d6555" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleAssignments/23dce7ec-59a2-0108-0ebd-3372c919144f" -> (known after apply)
      ~ name                             = "23dce7ec-59a2-0108-0ebd-3372c919144f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleAssignments/2febe555-6c00-9c00-a43a-11f4c96dd357" -> (known after apply)
      ~ name                             = "2febe555-6c00-9c00-a43a-11f4c96dd357" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleAssignments/fedaccd7-2dc3-c899-12b5-d6f6e4571982" -> (known after apply)
      ~ name                             = "fedaccd7-2dc3-c899-12b5-d6f6e4571982" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleAssignments/563de64b-ddab-6465-f18a-2071476a8c2c" -> (known after apply)
      ~ name                             = "563de64b-ddab-6465-f18a-2071476a8c2c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleAssignments/c8d6537d-4d85-9c14-9c82-89484b8acc1d" -> (known after apply)
      ~ name                             = "c8d6537d-4d85-9c14-9c82-89484b8acc1d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleAssignments/638e3ded-dc84-d163-b674-1468843dda79" -> (known after apply)
      ~ name                             = "638e3ded-dc84-d163-b674-1468843dda79" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleAssignments/2e1412dd-1fe1-011b-547f-c5a473a6c51d" -> (known after apply)
      ~ name                             = "2e1412dd-1fe1-011b-547f-c5a473a6c51d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/54168dc9-797d-c77a-e39a-3e90db85e03b" -> (known after apply)
      ~ name                             = "54168dc9-797d-c77a-e39a-3e90db85e03b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/6b6024cd-be96-97cd-7ebf-8af2fe4f311a" -> (known after apply)
      ~ name                             = "6b6024cd-be96-97cd-7ebf-8af2fe4f311a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleAssignments/a4028417-f6ca-607d-9c53-a9e5683e87fe" -> (known after apply)
      ~ name                             = "a4028417-f6ca-607d-9c53-a9e5683e87fe" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleAssignments/d8bc86e9-0038-30d4-bf1f-bc56913b5a99" -> (known after apply)
      ~ name                             = "d8bc86e9-0038-30d4-bf1f-bc56913b5a99" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleAssignments/f318b482-4f9b-83ad-8507-0ae00c5bbb15" -> (known after apply)
      ~ name                             = "f318b482-4f9b-83ad-8507-0ae00c5bbb15" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/00b9a00a-20eb-4173-b7b6-468e00836a33/providers/Microsoft.Authorization/roleAssignments/81d91364-aa6b-2d92-0d24-80315bc75e77" -> (known afte

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

nd Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT/providers/Microsoft.Authorization/roleAssignments/4c1885f1-1605-10f8-6a1b-fd36ba16a565" -> (known after apply)
      ~ name                             = "4c1885f1-1605-10f8-6a1b-fd36ba16a565" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-NonProd/providers/Microsoft.Authorization/roleAssignments/b77fb503-44a9-623a-a45b-a1aa58341d71" -> (known after apply)
      ~ name                             = "b77fb503-44a9-623a-a45b-a1aa58341d71" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-Prod/providers/Microsoft.Authorization/roleAssignments/24d7bbc0-f2b9-93d3-e5b6-dc9a1dcca06b" -> (known after apply)
      ~ name                             = "24d7bbc0-f2b9-93d3-e5b6-dc9a1dcca06b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["CFT-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox/providers/Microsoft.Authorization/roleAssignments/d7088374-ce23-79e6-cb89-a74a01ee9161" -> (known after apply)
      ~ name                             = "d7088374-ce23-79e6-cb89-a74a01ee9161" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Crime - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Crime/providers/Microsoft.Authorization/roleAssignments/7014a5b1-39e9-a14a-9867-a61b1d69d781" -> (known after apply)
      ~ name                             = "7014a5b1-39e9-a14a-9867-a61b1d69d781" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["HMCTS - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/HMCTS/providers/Microsoft.Authorization/roleAssignments/7bee89b5-edf3-08e6-6e68-88db4f0f0cbd" -> (known after apply)
      ~ name                             = "7bee89b5-edf3-08e6-6e68-88db4f0f0cbd" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage/providers/Microsoft.Authorization/roleAssignments/0ccd1abd-5c3d-60a1-e9e5-922d7126e1fa" -> (known after apply)
      ~ name                             = "0ccd1abd-5c3d-60a1-e9e5-922d7126e1fa" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd/providers/Microsoft.Authorization/roleAssignments/0c85fd93-4526-c5ef-78d4-aacda6211cd2" -> (known after apply)
      ~ name                             = "0c85fd93-4526-c5ef-78d4-aacda6211cd2" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-Prod/providers/Microsoft.Authorization/roleAssignments/f08125a0-fc67-d446-816c-8a9470670e22" -> (known after apply)
      ~ name                             = "f08125a0-fc67-d446-816c-8a9470670e22" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Heritage-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox/providers/Microsoft.Authorization/roleAssignments/a3a9cc12-aa34-e239-6836-d9348ed3fa3d" -> (known after apply)
      ~ name                             = "a3a9cc12-aa34-e239-6836-d9348ed3fa3d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform/providers/Microsoft.Authorization/roleAssignments/6c2dd637-8e82-3274-746e-b76d1fcaf6ba" -> (known after apply)
      ~ name                             = "6c2dd637-8e82-3274-746e-b76d1fcaf6ba" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-NonProd/providers/Microsoft.Authorization/roleAssignments/404bc07d-7452-ade2-9d70-adf10b8c0a10" -> (known after apply)
      ~ name                             = "404bc07d-7452-ade2-9d70-adf10b8c0a10" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-Prod/providers/Microsoft.Authorization/roleAssignments/ba8681f8-f843-26a7-bf6a-44be21404fe7" -> (known after apply)
      ~ name                             = "ba8681f8-f843-26a7-bf6a-44be21404fe7" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Platform-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox/providers/Microsoft.Authorization/roleAssignments/d2472494-61eb-b60d-05c6-6a81a5ead448" -> (known after apply)
      ~ name                             = "d2472494-61eb-b60d-05c6-6a81a5ead448" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS/providers/Microsoft.Authorization/roleAssignments/86d45e58-c0cd-08af-2a4c-7ab4ea14dc24" -> (known after apply)
      ~ name                             = "86d45e58-c0cd-08af-2a4c-7ab4ea14dc24" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-NonProd - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-NonProd/providers/Microsoft.Authorization/roleAssignments/3b3c744d-a133-3f37-4d3e-fe14c8670e64" -> (known after apply)
      ~ name                             = "3b3c744d-a133-3f37-4d3e-fe14c8670e64" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-Prod - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-Prod/providers/Microsoft.Authorization/roleAssignments/3bbe4e7d-72eb-e373-f4db-c1a3a76ccce6" -> (known after apply)
      ~ name                             = "3bbe4e7d-72eb-e373-f4db-c1a3a76ccce6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["SDS-Sandbox - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox/providers/Microsoft.Authorization/roleAssignments/0e93556a-e306-1700-6d17-8c887932702d" -> (known after apply)
      ~ name                             = "0e93556a-e306-1700-6d17-8c887932702d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["Security - Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      ~ id                               = "/providers/Microsoft.Management/managementGroups/Security/providers/Microsoft.Authorization/roleAssignments/8fd00fa9-9303-f12b-18e1-57698885cbd6" -> (known after apply)
      ~ name                             = "8fd00fa9-9303-f12b-18e1-57698885cbd6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 88 to add, 0 to change, 88 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->